app/controllers/memberships_controller.rb

INSERT INTO "memberships" ("first_name", "last_name", "diplome", "age", "activity", "massif", "periode", "passmorgiou", "passsormiou", "siret", "description", "user_id", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    # @membership = current_user.memberships.build(membership_params)
    @membership = Membership.new(membership_params)
    @membership.user = current_user
    authorize @membership

    respond_to do |format|
      if @membership.save

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "memberships" SET "diplome" = $1, "age" = $2, "siret" = $3, "description" = $4, "updated_at" = $5 WHERE "memberships"."id" = $6  [["diplome", "DE Escalade"], ["age", "05/12/1988"], ["siret", "123456789012457890"], ["description", "Coucou!"], ["updated_at", 2017-03-09 20:34:32 UTC], ["id", 1]]
---
  def update
    @membership = Membership.find(params[:id])
    @membership.update(membership_params)

DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 3]]
---
  def destroy
    @membership.destroy

SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_membership
      @membership = Membership.find(params[:id])